OpenFOAM/4.x/backwardFacingStepKasagi/Allrun
#!/bin/sh

./Allrun.pre
[ "$1" = "-m" ] && ./Allrun.monitor &
./Allrun.solve
./Allrun.plot

