OpenFOAM/4.x/backwardFacingStepKasagi/Allrun.monitor
#!/bin/sh
file=postProcessing/residuals/0/residuals.dat
while [ ! -f  $file ]
do
  sleep 1
done

foamMonitor -l $file &
