OpenFOAM/4.x/backwardFacingStepKasagi/Allrun.pre
#!/bin/sh

blockMesh > log.blockMesh 2>&1


