OpenFOAM/4.x/backwardFacingStepKasagi/Allrun.solve
#!/bin/sh

simpleFoam > log 2>&1

